In [1]:
import pandas as pd

In [2]:
data = {
    'name':['jack','marry','lily','aya'],
    'age':[19,19,17,20],
    'height':[1.68,1.37,1.62,1.55]
}
df = pd.DataFrame(data)
df

    name  age  height
0   jack   19    1.68
1  marry   19    1.37
2   lily   17    1.62
3    aya   20    1.55

In [3]:
df['name']

0     jack
1    marry
2     lily
3      aya
Name: name, dtype: object

In [4]:
df.name

0     jack
1    marry
2     lily
3      aya
Name: name, dtype: object

In [5]:
df[['name']]

    name
0   jack
1  marry
2   lily
3    aya

In [6]:
df[['name','height']]

    name  height
0   jack    1.68
1  marry    1.37
2   lily    1.62
3    aya    1.55

In [7]:
names = df['name']

In [8]:
names[0] = 'abc'

c:\users\贺青松\appdata\local\programs\python\python36-32\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [9]:
df

    name  age  height
0    abc   19    1.68
1  marry   19    1.37
2   lily   17    1.62
3    aya   20    1.55

In [11]:
names = df.name.copy()

In [12]:
names[0] = 'def'

In [13]:
names

0      def
1    marry
2     lily
3      aya
Name: name, dtype: object

In [14]:
df

    name  age  height
0    abc   19    1.68
1  marry   19    1.37
2   lily   17    1.62
3    aya   20    1.55

In [15]:
df.columns

Index(['name', 'age', 'height'], dtype='object')

In [16]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [17]:
df.columns[1:3]

Index(['age', 'height'], dtype='object')

In [18]:
df[df.columns[1:3]]

   age  height
0   19    1.68
1   19    1.37
2   17    1.62
3   20    1.55

In [20]:
import datetime

In [21]:
df['year'] = datetime.datetime.now().year - df.age

In [22]:
df

    name  age  height  year
0    abc   19    1.68  2000
1  marry   19    1.37  2000
2   lily   17    1.62  2002
3    aya   20    1.55  1999

In [23]:
df.drop('year',axis=1)

    name  age  height
0    abc   19    1.68
1  marry   19    1.37
2   lily   17    1.62
3    aya   20    1.55

In [25]:
df.drop(['height','year'],axis=1)

    name  age
0    abc   19
1  marry   19
2   lily   17
3    aya   20

In [26]:
df

    name  age  height  year
0    abc   19    1.68  2000
1  marry   19    1.37  2000
2   lily   17    1.62  2002
3    aya   20    1.55  1999

In [28]:
df.drop(df.columns[1::2],axis=1)

    name  height
0    abc    1.68
1  marry    1.37
2   lily    1.62
3    aya    1.55

In [29]:
df.loc[1]  # location 定位到

name      marry
age          19
height     1.37
year       2000
Name: 1, dtype: object

In [30]:
type(df.loc[1])

pandas.core.series.Series

In [31]:
df.loc[[1]]

    name  age  height  year
1  marry   19    1.37  2000

In [32]:
df.loc[[1,3]]

    name  age  height  year
1  marry   19    1.37  2000
3    aya   20    1.55  1999

In [33]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [34]:
df.index[-2:]

RangeIndex(start=2, stop=4, step=1)

In [35]:
df.loc[df.index[-2:]]

   name  age  height  year
2  lily   17    1.62  2002
3   aya   20    1.55  1999

In [36]:
df.loc[df.index[-2:],['name','age']]

   name  age
2  lily   17
3   aya   20

In [37]:
df

    name  age  height  year
0    abc   19    1.68  2000
1  marry   19    1.37  2000
2   lily   17    1.62  2002
3    aya   20    1.55  1999

In [38]:
df[1:3]

    name  age  height  year
1  marry   19    1.37  2000
2   lily   17    1.62  2002

In [39]:
df.shape

(4, 4)

In [40]:
df.loc[df.shape[0]] = {'age':21,'naem':'wild','height':175,'year':2010}  # 添加行数据

In [41]:
df

    name  age  height  year
0    abc   19    1.68  2000
1  marry   19    1.37  2000
2   lily   17    1.62  2002
3    aya   20    1.55  1999
4    NaN   21  175.00  2010

In [44]:
df2 = df.drop(2)
df2

    name  age  height  year
0    abc   19    1.68  2000
1  marry   19    1.37  2000
3    aya   20    1.55  1999
4    NaN   21  175.00  2010

In [45]:
df2.index = range(df2.shape[0])

In [46]:
df2

    name  age  height  year
0    abc   19    1.68  2000
1  marry   19    1.37  2000
2    aya   20    1.55  1999
3    NaN   21  175.00  2010

In [47]:
df2 = df.drop(2)
df2

    name  age  height  year
0    abc   19    1.68  2000
1  marry   19    1.37  2000
3    aya   20    1.55  1999
4    NaN   21  175.00  2010

In [50]:
df2.iloc[2]  # interger location

name       aya
age         20
height    1.55
year      1999
Name: 3, dtype: object

In [51]:
df2.index = list('ABCD')

In [52]:
df2

    name  age  height  year
A    abc   19    1.68  2000
B  marry   19    1.37  2000
C    aya   20    1.55  1999
D    NaN   21  175.00  2010

In [53]:
df2.iloc[1:3]

    name  age  height  year
B  marry   19    1.37  2000
C    aya   20    1.55  1999

In [54]:
df2.iat[1,1]

19

In [55]:
df2.iat[1,1] = 22

In [56]:
df2

    name  age  height  year
A    abc   19    1.68  2000
B  marry   22    1.37  2000
C    aya   20    1.55  1999
D    NaN   21  175.00  2010

In [57]:
df

    name  age  height  year
0    abc   19    1.68  2000
1  marry   19    1.37  2000
2   lily   17    1.62  2002
3    aya   20    1.55  1999
4    NaN   21  175.00  2010

In [58]:
df['height'] >= 1.65 # 返回布尔向量

0     True
1    False
2    False
3    False
4     True
Name: height, dtype: bool

In [59]:
df[df['height'] >= 1.65]

  name  age  height  year
0  abc   19    1.68  2000
4  NaN   21  175.00  2010

In [60]:
df[(df['height'] >= 1.65) & (df['age'] < 20)]

  name  age  height  year
0  abc   19    1.68  2000

In [61]:
df.query('height>=1.65 and age <=20')

  name  age  height  year
0  abc   19    1.68  2000

In [65]:
df.query('(height>=1.65 and age <=20) or (name=="lily")')

   name  age  height  year
0   abc   19    1.68  2000
2  lily   17    1.62  2002

In [67]:
age = 19
df.query('age==@age')

    name  age  height  year
0    abc   19    1.68  2000
1  marry   19    1.37  2000

In [68]:
df['age'].isin([18,19])

0     True
1     True
2    False
3    False
4    False
Name: age, dtype: bool

In [69]:
df[df['age'].isin([18,19])]

    name  age  height  year
0    abc   19    1.68  2000
1  marry   19    1.37  2000

In [70]:
df.T

           0      1     2     3     4
name     abc  marry  lily   aya   NaN
age       19     19    17    20    21
height  1.68   1.37  1.62  1.55   175
year    2000   2000  2002  1999  2010